{
    "email": "jnkj ",
    "password": "lm ,m mm ",
    "resume_data": {
        "personal_info": {},
        "education": [],
        "experience": [],
        "skills": [],
        "projects": [],
        "achievements": [],
        "raw_text": "Anannaya Agarwal\n# anannayaagarwal@gmail.com — (cid:131) +91 9179313462 — (cid:239) anannaya-agarwal\n§ anannayamustcode\nEducation\nPune Institute of Computer Technology Pune\n•\nBachelor of Engineering in Computer Technology; GPA: 8.86 2023 – present\nDelhi Public School Navi Mumbai\n•\nSecondary Education (CBSE); Percentage: 91.2% 2023\nPodar International School Navi Mumbai\n•\nHigher Secondary Education (CBSE); Percentage: 91% 2021\nTech Stack Skills\n• Web Development: HTML, CSS, JavaScript, React, Tailwind CSS, Node.js, Express.js\n• Database and App Development: MySQL, MongoDB, Firebase, React Native, Flutter (Dart)\n• Tools: Docker, Vercel, Git, GitHub, Figma, Python, C++\n• Programming Languages: Python, C++\nProjects\nReVamped Virtual Labs — HTML, CSS, JavaScript, React, Tailwind CSS, Node.js, git 2024\n• Designed an interactive virtual lab platform to enhance online learning and experimentation.\n• Optimized platform navigation and responsiveness, improving user experience and accessibility.\nWaySecure - Safe Routes Recommendation — React.js, Node.js, MongoDB, Express.js 2024\n• Developed an intelligent route recommendation system that prioritizes safety over speed, improving\nsecurity for women and children.\n• Implemented machine learning clustering algorithms to assess and determine the safest routes based on\ncrime data, real-time reports, and other safety parameters.\nBharatVarta — HTML, CSS, JavaScript 2023\n• Designed a platform integrating VR tours and an interactive state-wise map of India using Web3 and AI.\n• Increased visitor interaction rates with multimedia content by 100%.\nExtracurricular Activities\n• INC: Domain Coordinator- Impetus\nManaged and coordinated the domain of Computer Networks for Impetus and Concepts (Annual PICT technical event),\noverseeing 20 teams with over 100 participants and ensuring seamless execution of the event. Led teams, ensured smooth\noperations, and contributed to enhancing participant engagement.\n• NSS: Volunteer Participated in a rural school teaching activity, helping students enhance their learning experience\nthrough interactive and engaging sessions.\n• PASC: Marketing, Sponsors, Publicity Team Member Contributed to marketing, sponsorship acquisition, and\npublicity initiatives, helping promote events and increase engagement within the student community.\nAchievements\n• LeetCode: Solved 125+ questions.\n• Ranked 6th: IIIT Hyderabad coding competition.\n• Techfiesta: Reached the final round.\n• Smart India Hackathon: Ranked among the Top 25 teams from 200+ participants.\n• LeetCode Mania: Secured 10th position.\n",
        "errors": [
            "module 'google.generativeai' has no attribute 'responses'"
        ]
    }
}